Emacs_Key_Bindings_Elisp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs key bindings for Elisp programming</title>
<!-- 2017-10-08 Sun 12:17 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="description" content="Emacs programming and customization."
 />
<link href="theme/style2.css" rel="stylesheet">


</head>
<body>
<div id="content">
<h1 class="title">Emacs key bindings for Elisp programming</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Emacs key bindings for Elisp programming</a>
<ul>
<li><a href="#sec-1-1">1.1. Elisp Evaluation</a></li>
<li><a href="#sec-1-2">1.2. Elisp Debugger / Edebug</a></li>
<li><a href="#sec-1-3">1.3. Useful Commands</a></li>
<li><a href="#sec-1-4">1.4. IELM - Emacs Lisp Interpreter</a></li>
<li><a href="#sec-1-5">1.5. S-expression Navigation</a></li>
<li><a href="#sec-1-6">1.6. Delimiter Wrapping</a></li>
</ul>
</li>
</ul>
</div>
</div>
<a href="index.html">Top</a>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Emacs key bindings for Elisp programming</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Elisp Evaluation</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Command: M-x [command]</th>
<th scope="col" class="left">Key Binding</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">eval-last-sexp</td>
<td class="left">C-x C-e</td>
<td class="left">Evaluate last s-expression under cursor</td>
</tr>

<tr>
<td class="left">eval-print-last-sexp</td>
<td class="left">-</td>
<td class="left">Evaluate last s-expression under cursor and print.</td>
</tr>

<tr>
<td class="left">eval-expression</td>
<td class="left">M-:</td>
<td class="left">Execute S-expression in minibuffer.</td>
</tr>

<tr>
<td class="left">-</td>
<td class="left">C-u M-:</td>
<td class="left">Evaluate S-expression in minibuffer and insert result at point.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">eval-defun</td>
<td class="left">C-M-x</td>
<td class="left">Evaluates the outermost S-expression, regardless of cursor position</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">within the s-exp.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">eval-buffer</td>
<td class="left">C-c C-b</td>
<td class="left">Eval the whole buffer</td>
</tr>

<tr>
<td class="left">eval-region</td>
<td class="left">-</td>
<td class="left">Eval the selected text</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Eval and print last s-expression.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Eval last s-expression.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>repeat-complex-command</b></td>
<td class="left">C-x ESC ESC</td>
<td class="left">Useful to reverse engineering Emacs' commands executed with M-x like M-x</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">lgrep or repeat it.</td>
</tr>
</tbody>
</table>

<p>
Note: command <span class="underline">M-x repeat-complex-command</span>.
</p>

<p>
Example: User enter
</p>
<ul class="org-ul">
<li>M-x lgrep
</li>
<li>Prompt 1 -&gt; Search for: system.windows.forms
</li>
<li>Prompt 2 -&gt; In files (default *.org): *.org
</li>
<li>Prompt 3 -&gt; In directory: ~/Documents/wiki
</li>
</ul>

<p>
To extract the command type <span class="underline">C-x ESC ESC</span> and copy it from the
minibuffer with C-k and then paste with in the buffer with C-y. The
result will be:
</p>

<pre class="example">
(lgrep "system.windows.forms" "*.org" "~/Documents/wiki" nil)
</pre>

<p>
This s-expression can be run again or used in a function or any Elisp
app. Example:
</p>

<div class="org-src-container">

<pre class="src src-elisp">(<span class="org-keyword">defun</span> <span class="org-function-name">search-my-dir</span> ()
    (<span class="org-keyword">interactive</span>)
    (lgrep (read-string <span class="org-string">"Search wiki: "</span>) <span class="org-string">"*.org"</span> <span class="org-string">"~/Documents/wiki"</span> nil))
</pre>
</div>

<p>
<span class="underline">M-x search-my-dir system.windows</span> will search all *.org files containing
the line that matches system.windows in the directory ~/Documents/wiki.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Elisp Debugger / Edebug</h3>
<div class="outline-text-3" id="text-1-2">
<p>
This video shows how to use Edebugger to debug Elisp functions and
code: 
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Keybinding</th>
<th scope="col" class="left">M-x command</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><b>Emacs</b></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-u C-M-x</td>
<td class="left">edebug-defun</td>
<td class="left">Instrumment function for debugging.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>Inside Edebug</b></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">q</td>
<td class="left">&#xa0;</td>
<td class="left">Abort execution</td>
</tr>

<tr>
<td class="left">space</td>
<td class="left">&#xa0;</td>
<td class="left">Setep through, single step.</td>
</tr>

<tr>
<td class="left">b</td>
<td class="left">&#xa0;</td>
<td class="left">Insert breakpoint</td>
</tr>

<tr>
<td class="left">u</td>
<td class="left">&#xa0;</td>
<td class="left">Unset breakpoint.</td>
</tr>

<tr>
<td class="left">shift-G</td>
<td class="left">&#xa0;</td>
<td class="left">Continue beyond breakpoint</td>
</tr>

<tr>
<td class="left">i</td>
<td class="left">&#xa0;</td>
<td class="left">Jump to definition of defunction</td>
</tr>

<tr>
<td class="left">M-:</td>
<td class="left">&#xa0;</td>
<td class="left">Prompt for an expression to evaluate.</td>
</tr>

<tr>
<td class="left">c</td>
<td class="left">&#xa0;</td>
<td class="left">Continue execution</td>
</tr>

<tr>
<td class="left">x</td>
<td class="left">&#xa0;</td>
<td class="left">Set a conditional breakpoint</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Edebug info nodes documentation: 
</p>

<div class="org-src-container">

<pre class="src src-elisp">(info <span class="org-string">"(elisp) Edebug Execution Modes"</span>)

(info <span class="org-string">"(elisp) Instrumenting"</span>)
</pre>
</div>


<p>
See also: 
</p>

<ul class="org-ul">
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Edebug.html#Edebug">GNU Emacs Lisp Reference Manual: Edebug</a>
</li>
</ul>


<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=odkYXXYOxpo">Debugging basics by Nic Ferrier</a> - Edebug, instrumenting and
stepping and breakpoints. Also macroexpand and how it helps with
debugging.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Useful Commands</h3>
<div class="outline-text-3" id="text-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Command: M-x [command]</th>
<th scope="col" class="left">Key Binding</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">check-paren</td>
<td class="left">&#xa0;</td>
<td class="left">Find unmatched parenthesis</td>
</tr>

<tr>
<td class="left">checkdoc</td>
<td class="left">&#xa0;</td>
<td class="left">Check docstring in an Elisp package (*.el file).</td>
</tr>

<tr>
<td class="left">auto-insert</td>
<td class="left">&#xa0;</td>
<td class="left">Insert header file of an Elisp package's header file.</td>
</tr>

<tr>
<td class="left">view-echo-area-messages</td>
<td class="left">C-h e</td>
<td class="left">Show the message buffer</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>Elisp library</b></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">find-variable</td>
<td class="left">&#xa0;</td>
<td class="left">Open the elisp file at the point the variable is defined.</td>
</tr>

<tr>
<td class="left">find-library</td>
<td class="left">&#xa0;</td>
<td class="left">Open an Emacs library or package in the load-path.</td>
</tr>

<tr>
<td class="left">find-function</td>
<td class="left">&#xa0;</td>
<td class="left">Opens an library.el file at the point the function is defined.</td>
</tr>

<tr>
<td class="left">locate-library</td>
<td class="left">&#xa0;</td>
<td class="left">Show path of a library.el (Emacs Package) file.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>Documentation Commands</b></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">apropos</td>
<td class="left">&#xa0;</td>
<td class="left">Search for all elisp symbols, variables and functions that match a regex pattern.</td>
</tr>

<tr>
<td class="left">apropos-command</td>
<td class="left">C-h a</td>
<td class="left">Search for all commands (M-x cmd) that match a regexp pattern.</td>
</tr>

<tr>
<td class="left">apropos-library</td>
<td class="left">&#xa0;</td>
<td class="left">Show all symbols associated with an Elisp library (Emacs Package)</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">info-apropos</td>
<td class="left">&#xa0;</td>
<td class="left">Find all info pages that match a pattern.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">describe-function</td>
<td class="left">C-h f</td>
<td class="left">Show function documentation or docstring.</td>
</tr>

<tr>
<td class="left">describe-mode</td>
<td class="left">C-h m</td>
<td class="left">Show current major mode documentation and all key bindings associated.</td>
</tr>

<tr>
<td class="left">describe-bindings</td>
<td class="left">C-h-b</td>
<td class="left">Show all associated key bindings with the current buffer.</td>
</tr>

<tr>
<td class="left">describe-variable</td>
<td class="left">C-h v</td>
<td class="left">Show variable documentation</td>
</tr>

<tr>
<td class="left">describe-package</td>
<td class="left">&#xa0;</td>
<td class="left">Describe an Emacs package installed from Melpa repository.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> IELM - Emacs Lisp Interpreter</h3>
<div class="outline-text-3" id="text-1-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">M-x ielm</td>
<td class="left">Run Emacs Lisp Interpreter</td>
</tr>

<tr>
<td class="left">C-c C-b</td>
<td class="left">(IELM only) Change the current buffer of IELM. It is useful control buffers from IELM shell.</td>
</tr>

<tr>
<td class="left">C-[up]</td>
<td class="left">(All Shells) Get the next input in the history</td>
</tr>

<tr>
<td class="left">C-[down]</td>
<td class="left">(All Shells) Get the previous input in the history</td>
</tr>

<tr>
<td class="left">M-p</td>
<td class="left">(All Shells) Get the previous input in the history</td>
</tr>

<tr>
<td class="left">M-n</td>
<td class="left">(All Shells) Get the next input in the history</td>
</tr>

<tr>
<td class="left">C-c C-l</td>
<td class="left">Display the shell history in another window</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> S-expression Navigation</h3>
<div class="outline-text-3" id="text-1-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C-M-n</td>
<td class="left">Move forward over a parenthetical group</td>
</tr>

<tr>
<td class="left">C-M-p</td>
<td class="left">Move backward over a parenthetical group</td>
</tr>

<tr>
<td class="left">C-M-f</td>
<td class="left">Move forward over a balanced expression</td>
</tr>

<tr>
<td class="left">C-M-b</td>
<td class="left">Move backward over a balanced expression</td>
</tr>

<tr>
<td class="left">C-M-k</td>
<td class="left">Delete s-expression under cursor</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-M-a</td>
<td class="left">Move to the beggining of current function</td>
</tr>

<tr>
<td class="left">C-M-e</td>
<td class="left">Move to the end of current function</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Delimiter Wrapping</h3>
<div class="outline-text-3" id="text-1-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">M-(</td>
<td class="left">Wrap selection in parentheses</td>
</tr>

<tr>
<td class="left">M-[</td>
<td class="left">Wrap selection in square brackets</td>
</tr>

<tr>
<td class="left">M-{</td>
<td class="left">Wrap selection in curly brackets</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-10-08 Sun 12:17</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
